Delans-TLE/src/Documents/ES_Приемка/ES_Приемка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_Приемка</name>
  <basedOn>Document.ES_ПеремещениеЗаказов</basedOn>
  <basedOn>Document.ES_ОтчетОДоставке</basedOn>
  <basedOn>Document.ES_Поставка</basedOn>
  <basedOn>Document.ES_ЗаборГруза</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>InformationRegister.ES_СтатусыЗаказов</registerRecords>
  <registerRecords>InformationRegister.ES_ИзменяемыеРеквизитыЗаборов</registerRecords>
  <registerRecords>AccumulationRegister.ES_Поставка</registerRecords>
  <registerRecords>InformationRegister.ES_ИзменяемыеРеквизитыЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыВПути</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыУКурьера</registerRecords>
  <registerRecords>InformationRegister.ES_СведенияОЗаказах</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ES_НаложенныеПлатежиПартнеров</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ES_ПеремещениеЗаказов</types>
      <types>DocumentRef.ES_ЗаборГруза</types>
      <types>DocumentRef.ES_Поставка</types>
      <types>DocumentRef.ES_ОтчетОДоставке</types>
      <types>DocumentRef.ES_Возвраты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ES_ВидыОперацийПриемки</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ES_ЗаборГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязанныйДокумент</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ES_ЗаборГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВхНакладная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланДоставки</name>
      <type>
        <types>DocumentRef.ES_ПланДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Курьер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Некондиция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Реестр</name>
      <type>
        <types>CatalogRef.ES_Реестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяДобавленияЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Аббревиатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъемныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>EnumRef.ES_СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоставки</name>
      <type>
        <types>EnumRef.ES_ВидыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Недостача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Мест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ES_ПеремещениеЗаказов</types>
        <types>DocumentRef.ES_ПланДоставки</types>
        <types>DocumentRef.ES_ЗаборГруза</types>
        <types>DocumentRef.ES_Поставка</types>
        <types>DocumentRef.ES_ОтчетОДоставке</types>
      </type>
    </attributes>
    <attributes>
      <name>Излишек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВЗаказе</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатурыЗапас</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НППлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбьявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Опасность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>EnumRef.ES_СтатусыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоставки</name>
      <type>
        <types>EnumRef.ES_ВидыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>НПФактНал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НПФактБезнал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/Documents/ES_Приемка/Forms/ФормаРасхождения/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументПоставка") И Параметры.Свойство("ДокументПриемка") Тогда
		ЗаполнитьТЧ(Параметры.ДокументПоставка,Параметры.ДокументПриемка);
		ДокументПоставка = Параметры.ДокументПоставка;
		ДокументПриемка = Параметры.ДокументПриемка;
	КонецЕсли;
	
	
		    	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ (ДокументПоставка,ДокументПриемка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ES_ПоставкаЗаказы.Заказ КАК ЗаказВПоставке,
		|	1 КАК КоличествоПлан
		|ПОМЕСТИТЬ ВТ_Поставка
		|ИЗ
		|	Документ.ES_Поставка.Заказы КАК ES_ПоставкаЗаказы
		|ГДЕ
		|	ES_ПоставкаЗаказы.Ссылка = &ДокументПоставка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ES_ПриемкаЗаказы.Заказ КАК ЗаказВПриемке,
		|	ЕСТЬNULL(ES_ПриемкаЗаказы.Некондиция, ЛОЖЬ) КАК Некондиция
		|ПОМЕСТИТЬ ВТ_Приемка
		|ИЗ
		|	Документ.ES_Приемка.Заказы КАК ES_ПриемкаЗаказы
		|ГДЕ
		|	ES_ПриемкаЗаказы.Ссылка = &ДокументПриемка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Поставка.ЗаказВПоставке КАК Заказ,
		|	ВТ_Поставка.КоличествоПлан,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_Приемка.ЗаказВПриемке, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоФакт,
		|	ВТ_Приемка.Некондиция
		|ИЗ
		|	ВТ_Поставка КАК ВТ_Поставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Приемка КАК ВТ_Приемка
		|		ПО ВТ_Поставка.ЗаказВПоставке = ВТ_Приемка.ЗаказВПриемке";
	
	Запрос.УстановитьПараметр("ДокументПоставка", ДокументПоставка);
	Запрос.УстановитьПараметр("ДокументПриемка", ДокументПриемка);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Заказы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);	
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ДокументПриемка.Видимость = ЗначениеЗаполнено(ДокументПриемка);
	Элементы.ДокументПоставка.Видимость = ЗначениеЗаполнено(ДокументПоставка);
	
КонецПроцедуры
